DataProcessors/ТелеграмКарта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмКарта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслироватьГеопозицию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТелеграмГеоданныеКонтакта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмГеоданныеКонтакта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>latitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>longitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТелеграмКарта/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ИнициализироватьКарту(КодМаршрута = "")

	Текст = ПолучитьТекстМакета("МакетOSR");
	Если ТаблицаАдресов.Количество() = 0 Тогда
		ШиротаЦентр = "48.7520";
		ДолготаЦентр = "37.5976";
	Иначе
		ШиротаЦентр = Формат(ТаблицаАдресов[0].Широта, "ЧЦ=15; ЧДЦ=12; ЧРД=.; ЧГ=0");
		ДолготаЦентр = Формат(ТаблицаАдресов[0].Долгота, "ЧЦ=15; ЧДЦ=12; ЧРД=.; ЧГ=0");
	КонецЕсли;
	Текст = СтрЗаменить(Текст, "&ШиротаЦентр", ШиротаЦентр);
	Текст = СтрЗаменить(Текст, "&ДолготаЦентр", ДолготаЦентр);
	ТекстHTML = СтрЗаменить(Текст, "&КодМаршрута", КодМаршрута);

КонецПроцедуры

&НаСервере
Функция ПолучитьТекстМакета(ИмяМакета)

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	Результат = Макет.ПолучитьТекст();
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ГеокодироватьOSR()

	Обработка = РеквизитФормыВЗначение("Объект");
	Координаты = Обработка.ГеокодироватьАдрес(ТекАдрес);
	Если Координаты <> Неопределено Тогда
		стрАдрес = ТаблицаАдресов.Добавить();
		стрАдрес.Широта = Координаты.Широта;
		стрАдрес.Долгота = Координаты.Долгота;
		стрАдрес.Адрес = Координаты.Адрес;
	КонецЕсли;
	МассивАдресов = Новый Массив();
	Для каждого стрАдрес Из ТаблицаАдресов Цикл
		МассивАдресов.Добавить(Новый Структура("Адрес,Широта,Долгота", стрАдрес.Адрес, стрАдрес.Широта, стрАдрес.Долгота));
	КонецЦикла;
	Если МассивАдресов.Количество() Тогда
		КодМаршрута = Обработка.СформироватьJavaScriptМаршрута(МассивАдресов);
	Иначе
		КодМаршрута = "";
	КонецЕсли;
	ИнициализироватьКарту(КодМаршрута);

КонецПроцедуры

&НаСервере
Процедура ПостроитьМаршрутOSR()

	КодМаршрута = РеквизитФормыВЗначение("Объект").ВыполнитьРасчетМаршрута(ТаблицаАдресов.Выгрузить());
	ИнициализироватьКарту(КодМаршрута);

КонецПроцедуры

&НаКлиенте
Процедура ПоискАдреса(Адрес)

	ГеокодироватьOSR();

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НайтиАдрес(Команда)

	ПоискАдреса(ТекАдрес);

КонецПроцедуры


#Область ОбработчикиСОбытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИнициализироватьКарту();

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПостроитьМаршрут(Команда)

	Если ТаблицаАдресов.Количество() <= 1 Тогда
		ПоказатьПредупреждение(, "Недостаточно точек для построение маршрута!");
		Возврат;
	КонецЕсли;
	
	ПостроитьМаршрутOSR();

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)

	ТаблицаАдресов.Очистить();
	ИнициализироватьКарту();

КонецПроцедуры

&НаКлиенте
Процедура ТекАдресПриИзменении(Элемент)

	ПоискАдреса(ТекАдрес);

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ПоследниеГеоданные = РегистрыСведений.ТелеграмГеоданныеКонтакта.ПолучитьПоследнее(,Новый Структура("ТелеграмКонтакт", Объект.ТелеграмКонтакт));	
	
	
	КодМаршрута = "L.marker(["+Формат(ПоследниеГеоданные.latitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0")+", "+Формат(ПоследниеГеоданные.longitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0")+"], {title: '" + Строка(Объект.ТелеграмКонтакт) + "'}).addTo(map);
		|	";

	Текст = ПолучитьТекстМакета("МакетOSR");
	
	ШиротаЦентр = Формат(ПоследниеГеоданные.latitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0");
	ДолготаЦентр = Формат(ПоследниеГеоданные.longitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0");
	
	Текст = СтрЗаменить(Текст, "&ШиротаЦентр", ШиротаЦентр);
	Текст = СтрЗаменить(Текст, "&ДолготаЦентр", ДолготаЦентр);
	ТекстHTML = СтрЗаменить(Текст, "&КодМаршрута", КодМаршрута);

	

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПостроитьТрекНаСервере()
	
		
	ЗапросГеоданных = Новый Запрос();
	ЗапросГеоданных.Текст = "ВЫБРАТЬ
	                        |	ТелеграмГеоданныеКонтакта.Период КАК Период,
	                        |	ТелеграмГеоданныеКонтакта.latitude КАК latitude,
	                        |	ТелеграмГеоданныеКонтакта.longitude КАК longitude
	                        |ИЗ
	                        |	РегистрСведений.ТелеграмГеоданныеКонтакта КАК ТелеграмГеоданныеКонтакта
	                        |ГДЕ
	                        |	ТелеграмГеоданныеКонтакта.ТелеграмКонтакт = &ТелеграмКонтакт
	                        |	И ТелеграмГеоданныеКонтакта.Период МЕЖДУ &ДатаНач И &ДатаКон
	                        |
	                        |УПОРЯДОЧИТЬ ПО
	                        |	Период";
	
	ЗапросГеоданных.УстановитьПараметр("ТелеграмКонтакт", объект.ТелеграмКонтакт);
	ЗапросГеоданных.УстановитьПараметр("ДатаНач", Объект.ДатаНачала);
	ЗапросГеоданных.УстановитьПараметр("ДатаКон", Объект.ДатаОкончания);
	ВыборкаГеоданных = ЗапросГеоданных.Выполнить().Выбрать();
	
	КодМаршрута = "";
	
	Пока ВыборкаГеоданных.Следующий() Цикл
	
		КодМаршрута = КодМаршрута + "L.marker(["+Формат(ВыборкаГеоданных.latitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0")+", "+Формат(ВыборкаГеоданных.longitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0")+"], {title: '" + Строка(Объект.ТелеграмКонтакт) + "'}).addTo(map);
			|	";
	КонецЦикла;
	
	Текст = ПолучитьТекстМакета("МакетOSR");
	
	ШиротаЦентр = Формат(ВыборкаГеоданных.latitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0");
	ДолготаЦентр = Формат(ВыборкаГеоданных.longitude, "ЧЦ=16; ЧДЦ=12; ЧРД=.; ЧГ=0");
	
	Текст = СтрЗаменить(Текст, "&ШиротаЦентр", ШиротаЦентр);
	Текст = СтрЗаменить(Текст, "&ДолготаЦентр", ДолготаЦентр);
	ТекстHTML = СтрЗаменить(Текст, "&КодМаршрута", КодМаршрута);

	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьТрек(Команда)
	ПостроитьТрекНаСервере();
КонецПроцедуры

#КонецОбласти
